main_menu = '''Главное меню
    1. Открыть файл
    2. Сохранить файл
    3. Показать все файлы
    4. Создать новый контакт
    5. Найти контакт
    6. Изменить контакт
    7. Удалить контакт
    8. Выход
'''


menu_choice = 'Выберите пункт меню: '
input_error = 'Некорректный ввод. Введите от 1 до 8'
book_error = 'Телефонный книга пуста или файл не открыт'
open_successful = 'Телефонная книга успешно открыта!'
input_new_contact = 'Введите данные нового контакта: '
new_contact = ['Введите имя контакта:', 'Введите телефон контакта:', 'Введите коммент:']
search_word = 'Введите искомый элемент: '
input_index = 'Введите индекс изменяемого контакта: '
input_index_delete = 'Введите индекс удаляемого контакта: '
input_change_contact = 'Введите данные изменяемого контакта или Enter чтобы оставить без изменений'
delete_error = 'Вы отказались удалить контакт'
file_saved = 'Файл успешно сохранен.'
check_exit = f'Исходный файл изменен. Сохранить данные?:\n1 - да\n2 - нет\n'
file_close = 'Телефонная книга успешно закрыто!'


def contact_saved(name: str):
    return f'Контакт {name} успешно сохранен'

def contact_change(name: str):
    return f'Контакт {name} успешно изменен'

def delete_contact(name: str):
    return f'Контакт {name} успешно удален.'

def check_delete_contact(name: str):
    return f'Удалить контакт по имени: {name}?\n1 - да\n2 - нет\n'
